# Libraries & Settings

In [1]:
import sys
import numpy as np
import pandas as pd
import matplotlib as mpl
import matplotlib.pyplot as plt
import seaborn as sns

# Acquire Data

In [2]:
df_test = pd.read_csv("./Data/test.csv")
df_train = pd.read_csv("./Data/train.csv")

In [3]:
back_up = df_train

In [4]:
df_train.head()

,key,fare_amount,pickup_datetime,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count
0,2009-06-15 17:26:21.0000001,4.5,2009-06-15 17:26:21 UTC,-73.844311,40.721319,-73.841610,40.712278,1
1,2010-01-05 16:52:16.0000002,16.9,2010-01-05 16:52:16 UTC,-74.016048,40.711303,-73.979268,40.782004,1
2,2011-08-18 00:35:00.00000049,5.7,2011-08-18 00:35:00 UTC,-73.982738,40.761270,-73.991242,40.750562,2
3,2012-04-21 04:30:42.0000001,7.7,2012-04-21 04:30:42 UTC,-73.987130,40.733143,-73.991567,40.758092,1
4,2010-03-09 07:51:00.000000135,5.3,2010-03-09 07:51:00 UTC,-73.968095,40.768008,-73.956655,40.783762,1


### Comparing Columns

In [5]:
df_train.info()
print('_'*40)
df_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 55423856 entries, 0 to 55423855
Data columns (total 8 columns):
 #   Column             Dtype
---  ------             -----
 0   key                object
 1   fare_amount        float64
 2   pickup_datetime    object
 3   pickup_longitude   float64
 4   pickup_latitude    float64
 5   dropoff_longitude  float64
 6   dropoff_latitude   float64
 7   passenger_count    int64
dtypes: float64(5), int64(1), object(2)
memory usage: 3.3+ GB
________________________________________
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9914 entries, 0 to 9913
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   key                9914 non-null   object
 1   pickup_datetime    9914 non-null   object
 2   pickup_longitude   9914 non-null   float64
 3   pickup_latitude    9914 non-null   float64
 4   dropoff_longitude  9914 non-null   float64
 5   dropoff_latitude   9914 non-null   float64
 6   passenger_count    9914 non-null   int64
dtypes: float64(4), int64(1), object(2)
memory usage: 542.3+ KB

In [6]:

# find different column
train_columns = pd.DataFrame({"Diff_Column": df_train.columns,
                            "train_data" : range(len(df_train.columns.tolist()))})

test_columns = pd.DataFrame({'Diff_Column': df_test.columns, 
                             'test_data': range(len(df_test.columns.tolist()))})

col_merged = pd.merge(train_columns, test_columns, on = 'Diff_Column', how = 'left') # compare by column name

diff_columns = []
for i in col_merged[col_merged.isnull().any(axis = 1)]['Diff_Column']:
    diff_columns.append(i)

In [7]:
# Change Column

re_index = list(df_test.columns)

for col in df_train.columns:
    if col in diff_columns :
        re_index.append(col)
        
df_train = df_train.reindex(columns = re_index)

In [8]:
df_train.tail()

,key,pickup_datetime,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count,fare_amount
55423851,2014-03-15 03:28:00.00000070,2014-03-15 03:28:00 UTC,-74.005272,40.740027,-73.963280,40.762555,1,14.0
55423852,2009-03-24 20:46:20.0000002,2009-03-24 20:46:20 UTC,-73.957784,40.765530,-73.951640,40.773959,1,4.2
55423853,2011-04-02 22:04:24.0000004,2011-04-02 22:04:24 UTC,-73.970505,40.752325,-73.960537,40.797342,1,14.1
55423854,2011-10-26 05:57:51.0000002,2011-10-26 05:57:51 UTC,-73.980901,40.764629,-73.870605,40.773963,1,28.9
55423855,2014-12-12 11:33:00.00000015,2014-12-12 11:33:00 UTC,-73.969722,40.797668,-73.970885,40.783313,1,7.5

In [9]:
train_info = pd.DataFrame(zip(df_train.columns, df_train.count(),df_train.nunique(), df_train.dtypes))
train_info.columns = ['Column', 'Count', 'Unique', 'Dtype']
test_info = pd.DataFrame(zip(df_test.columns, df_test.count(), df_test.nunique(), df_test.dtypes))
test_info.columns = ['Column', 'Count', 'Unique', 'Dtype']
pd.concat([train_info, test_info], axis = 1, join ='outer',
          keys = ['train info','test info'])#.reindex=[train_info.index]

          train info                                       test info          \
              Column     Count    Unique    Dtype             Column   Count
0                key  55423856  55423855   object                key  9914.0
1    pickup_datetime  55423856  26173536   object    pickup_datetime  9914.0
2   pickup_longitude  55423856    349893  float64   pickup_longitude  9914.0
3    pickup_latitude  55423856    350945  float64    pickup_latitude  9914.0
4  dropoff_longitude  55423480    447504  float64  dropoff_longitude  9914.0
5   dropoff_latitude  55423480    450505  float64   dropoff_latitude  9914.0
6    passenger_count  55423856        15    int64    passenger_count  9914.0
7        fare_amount  55423856      9969  float64                NaN     NaN


   Unique    Dtype
0  9914.0   object
1  1753.0   object
2  9125.0  float64
3  9247.0  float64
4  9142.0  float64
5  9360.0  float64
6     6.0    int64
7     NaN      NaN

## Data Processing

In [36]:
df_train.describe()

,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,fare_amount,passenger_count
count,5.542348e+07,5.542348e+07,5.542348e+07,5.542348e+07,5.542348e+07,5.542348e+07
mean,-7.250973e+01,3.991982e+01,-7.251121e+01,3.992068e+01,1.134500e+01,7.099418e-01
std,1.284878e+01,9.642324e+00,1.278220e+01,9.633346e+00,2.071087e+01,1.342661e+00
min,-3.442060e+03,-3.492264e+03,-3.442025e+03,-3.547887e+03,-3.000000e+02,0.000000e+00
25%,-7.399207e+01,4.073493e+01,-7.399140e+01,4.073403e+01,6.000000e+00,0.000000e+00
50%,-7.398180e+01,4.075265e+01,-7.398015e+01,4.075316e+01,8.500000e+00,0.000000e+00
75%,-7.396708e+01,4.076713e+01,-7.396367e+01,4.076810e+01,1.250000e+01,1.000000e+00
max,3.457626e+03,3.408790e+03,3.457622e+03,3.537133e+03,9.396336e+04,1.400000e+01

### Missing Value

In [37]:
round((df_train.isnull().sum()/len(df_train)*10000).sort_values(ascending=False),1)

passenger_count      0.0
fare_amount          0.0
dropoff_latitude     0.0
dropoff_longitude    0.0
pickup_latitude      0.0
pickup_longitude     0.0
pickup_datetime      0.0
key                  0.0
dtype: float64

In [22]:
round((df_test.isnull().sum()/len(df_test)*100).sort_values(ascending=False),1)

passenger_count      0.0
dropoff_latitude     0.0
dropoff_longitude    0.0
pickup_latitude      0.0
pickup_longitude     0.0
pickup_datetime      0.0
key                  0.0
dtype: float64

In [35]:
print("Train Null data\n")
print(df_train.isna().sum())
print("\nTest Null data\n")
print(df_test.isna().sum())

Train Null data

key                  0
pickup_datetime      0
pickup_longitude     0
pickup_latitude      0
dropoff_longitude    0
dropoff_latitude     0
fare_amount          0
passenger_count      0
dtype: int64

Test Null data

key                  0
pickup_datetime      0
pickup_longitude     0
pickup_latitude      0
dropoff_longitude    0
dropoff_latitude     0
passenger_count      0
dtype: int64

In [34]:
df_train = df_train.dropna(axis=0)